tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "localsend/localsend"
tap "powershell/tap"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Render markdown on the CLI
brew "glow"
# Improved top (interactive process viewer)
brew "htop"
# Simple terminal UI for git commands
brew "lazygit"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Manage compile and link flags for libraries
brew "pkg-config"
# SMART hard drive monitoring
brew "smartmontools"
# Cross-shell prompt for astronauts
brew "starship"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Formula to install PowerShell
brew "powershell/tap/powershell"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Server and cloud storage browser
cask "cyberduck"
# Universal database tool and SQL client
cask "dbeaver-community"
# Web browser
cask "firefox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# An open source cross-platform alternative to AirDrop
cask "localsend"
# Finder Toolbar app to open the current directory in Editor
cask "openineditor-lite"
# Finder Toolbar app to open the current directory in Terminal
cask "openinterminal-lite"
# Android file transfer
cask "openmtp"
# Command-line shell and scripting language
cask "powershell"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Terminal emulator, SSH and serial client
cask "tabby"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Multiplayer code editor
cask "zed"
