tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/services"
tap "leoafarias/fvm"
tap "localsend/localsend"
tap "powershell/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# Light UNIX download accelerator
brew "axel"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Improved top (interactive process viewer)
brew "htop"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Simple terminal UI for git commands
brew "lazygit"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Manage compile and link flags for libraries
brew "pkg-config"
# SMART hard drive monitoring
brew "smartmontools"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Encoding detector library
brew "uchardet"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Emulator of x86-based machines based on PCem
cask "86box"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# E-books management software
cask "calibre"
# Server and cloud storage browser
cask "cyberduck"
# Universal database tool and SQL client
cask "dbeaver-community"
# Web browser
cask "firefox"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Hex editor focussing on speed
cask "hex-fiend"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Media system
cask "jellyfin"
# File archiver
cask "keka"
# GPU-based terminal emulator
cask "kitty"
# An open source cross-platform alternative to AirDrop
cask "localsend"
# Finder Toolbar app to open the current directory in Editor
cask "openineditor-lite"
# Finder Toolbar app to open the current directory in Terminal
cask "openinterminal-lite"
# Android file transfer
cask "openmtp"
# Replacement for Docker Desktop
cask "orbstack"
# Command-line shell and scripting language
cask "powershell"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Utilise mouse side navigation buttons
cask "sensiblesidebuttons"
# System monitor for the menu bar
cask "stats"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Terminal emulator, SSH and serial client
cask "tabby"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Open-source BitTorrent client
cask "transmission"
# PKG software package uninstall tool
cask "uninstallpkg"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Multiplayer code editor
cask "zed"
