tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "powershell/tap"
tap "tabbyml/tabby"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Python code formatter
brew "black"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Render markdown on the CLI
brew "glow"
# Improved top (interactive process viewer)
brew "htop"
# Simple terminal UI for git commands
brew "lazygit"
# Building blocks for modern adaptive GNOME applications
brew "libadwaita"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform application and UI framework
brew "qt@5"
# SMART hard drive monitoring
brew "smartmontools"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# Formula to install PowerShell
brew "powershell/tap/powershell", link: false
# Tabby: AI Coding Assitatnt
brew "tabbyml/tabby/tabby"
# Enable Windows-like alt-tab
cask "alt-tab"
# Family of tools to build, test and package software
cask "cmake"
# Universal database tool and SQL client
cask "dbeaver-community"
# Web browser
cask "firefox"
# Git client focusing on productivity
cask "gitkraken"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Finder Toolbar app to open the current directory in Editor
cask "openineditor-lite"
# Finder Toolbar app to open the current directory in Terminal
cask "openinterminal-lite"
# Android file transfer
cask "openmtp"
# Command-line shell and scripting language
cask "powershell"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Terminal emulator, SSH and serial client
cask "tabby"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# View output from scripts in the menu bar
cask "xbar"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Multiplayer code editor
cask "zed"
